Revit 2024 API
BuiltInFailures.DPartFailures.PartsCannotBeCreatedFromInvalidGeom Property
 Post failure when attempts to create parts from invalid geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PartsCannotBeCreatedFromInvalidGeom { get; }
Visual Basic
Public Shared ReadOnly Property PartsCannotBeCreatedFromInvalidGeom As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PartsCannotBeCreatedFromInvalidGeom {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace